Repository: toanhvt98/myshop
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: vi

source: Token is missing.
vi: Thiếu mã thông báo.

source: An error occurred while authenticating your request. Please try again later or contact support.
vi: Đã xảy ra lỗi khi xác thực yêu cầu của bạn. Vui lòng thử lại sau hoặc liên hệ hỗ trợ.

source: Invalid token.
vi: Mã thông báo không hợp lệ.

source: Incorrect authentication credentials.
vi: Thông tin xác thực không chính xác.

source: Request was throttled.
vi: Yêu cầu đã bị giới hạn.

source: Invalid input.
vi: Đầu vào không hợp lệ.

source: 2FA App
vi: Ứng dụng 2FA

source: Email OTP
vi: OTP qua Email

source: Suspicious Spam Activity
vi: Hoạt động Spam đáng ngờ

source: Violation of Terms of Service
vi: Vi phạm Điều khoản dịch vụ

source: Frozen by Administrator
vi: Bị quản trị viên đóng băng

source: Too many failed login attempts
vi: Quá nhiều lần đăng nhập thất bại

source: User Inactive for too long
vi: Người dùng không hoạt động quá lâu

source: Other
vi: Khác

source: System
vi: Hệ thống

source: Admin
vi: Quản trị viên

source: Staff
vi: Nhân viên

source: Email is required.
vi: Email là bắt buộc.

source: Please enter a valid email address.
vi: Vui lòng nhập địa chỉ email hợp lệ.

source: Password is required.
vi: Mật khẩu là bắt buộc.

source: OTP code is required.
vi: Mã OTP là bắt buộc.

source: Type is required.
vi: Kiểu là bắt buộc.

source: Please enter a valid type.
vi: Vui lòng nhập kiểu hợp lệ.

source: OTP type is missing.
vi: Thiếu loại OTP.

source: OTP code is missing.
vi: Thiếu mã OTP.

source: Male
vi: Nam

source: Female
vi: Nữ

source: Not Say
vi: Không muốn nói

source: Unknown gender
vi: Giới tính không xác định

source: New password is required.
vi: Mật khẩu mới là bắt buộc.

source: New password confirmation is required.
vi: Xác nhận mật khẩu mới là bắt buộc.

source: Passwords do not match.
vi: Mật khẩu không khớp.

source: Password confirmation is required.
vi: Xác nhận mật khẩu là bắt buộc.

source: First name is required.
vi: Tên là bắt buộc.

source: First name must be at least 2 characters long.
vi: Tên phải dài ít nhất 2 ký tự.

source: First name must be at most 30 characters long.
vi: Tên phải dài tối đa 30 ký tự.

source: Last name is required.
vi: Họ là bắt buộc.

source: Last name must be at least 2 characters long.
vi: Họ phải dài ít nhất 2 ký tự.

source: Last name must be at most 30 characters long.
vi: Họ phải dài tối đa 30 ký tự.

source: Please enter a valid date.
vi: Vui lòng nhập ngày hợp lệ.

source: Please enter a valid gender.
vi: Vui lòng nhập giới tính hợp lệ.

source: This email is already registered.
vi: Email này đã được đăng ký.

source: Your login code
vi: Mã đăng nhập của bạn

source: Invalid credentials
vi: Thông tin đăng nhập không hợp lệ

source: Your account has already been deactivated. Please contact support.
vi: Tài khoản của bạn đã bị vô hiệu hóa. Vui lòng liên hệ hỗ trợ.

source: OTP was expired. Please try again.
vi: OTP đã hết hạn. Vui lòng thử lại.

source: Exceeded the number of allowed logins
vi: Vượt quá số lần đăng nhập cho phép

source: Your account has been deactivated!
vi: Tài khoản của bạn đã bị vô hiệu hóa!

source: Your account has been deactivated. Please contact support.
vi: Tài khoản của bạn đã bị vô hiệu hóa. Vui lòng liên hệ hỗ trợ.

source: Your account is locked. Please try again after * seconds. <{times}>
vi: Tài khoản của bạn đã bị khóa. Vui lòng thử lại sau * giây. <{times}>

source: Invalid credentials. Your account will be locked after {attempts_left} more attempts.
vi: Thông tin đăng nhập không hợp lệ. Tài khoản của bạn sẽ bị khóa sau {attempts_left} lần thử nữa.

source: Invalid credentials.
vi: Thông tin đăng nhập không hợp lệ.

source: Two factor authentication is not enabled. Please contact support.
vi: Xác thực hai yếu tố chưa được bật. Vui lòng liên hệ hỗ trợ.

source: Cannot request OTP at this time. Please try again after * seconds. <{times}>
vi: Không thể yêu cầu OTP vào lúc này. Vui lòng thử lại sau * giây. <{times}>

source: Email is already registered.
vi: Email đã được đăng ký.

source: An error occurred, please try again.
vi: Đã xảy ra lỗi, vui lòng thử lại.

source: Two factor authentication is not enabled. Please contact support for assistance.
vi: Xác thực hai yếu tố chưa được bật. Vui lòng liên hệ hỗ trợ để được trợ giúp.

source: Your Password Reset Code
vi: Mã đặt lại mật khẩu của bạn

source: Could not create user at this time.
vi: Không thể tạo người dùng vào lúc này.

source: An error occurred, please register again.
vi: Đã xảy ra lỗi, vui lòng đăng ký lại.

source: Here is your OTP code
vi: Đây là mã OTP của bạn

source: Hello %(first_name)s %(last_name)s,
vi: Xin chào %(first_name)s %(last_name)s,

source: You recently requested to reset your password for your <strong>%(site_name)s</strong> account. Please use the following one-time password (OTP) to complete the process:
vi: Bạn gần đây đã yêu cầu đặt lại mật khẩu cho tài khoản <strong>%(site_name)s</strong> của mình. Vui lòng sử dụng mật khẩu một lần (OTP) sau để hoàn tất quá trình:

source: This code is valid for **%(otp_expiry_minutes)s minutes**.
vi: Mã này có hiệu lực trong **%(otp_expiry_minutes)s phút**.

source: For your security, <strong>do not share</strong> this code with anyone, even if they claim to be from %(site_name)s.
vi: Vì sự an toàn của bạn, <strong>đừng chia sẻ</strong> mã này với bất kỳ ai, ngay cả khi họ tự xưng đến từ %(site_name)s.

source: If you did not request a password reset, please ignore this email.
vi: Nếu bạn không yêu cầu đặt lại mật khẩu, vui lòng bỏ qua email này.

source: Dear, %(site_name)s support team.
vi: Kính gửi, Đội ngũ hỗ trợ %(site_name)s.

source: <p>&copy; %(current_year)s %(site_name)s. All rights reserved.</p>
vi: <p>&copy; %(current_year)s %(site_name)s. Mọi quyền được bảo lưu.</p>

source: This is an automated email; please do not reply.
vi: Đây là một email tự động; vui lòng không trả lời.

source: %(site_name)s - Your Email Verification Code
vi: %(site_name)s - Mã xác minh Email của bạn

source: <p>Thank you for registering with %(site_name)s. To complete your registration and verify your email address, please use the one-time password (OTP) below:</p>
vi: <p>Cảm ơn bạn đã đăng ký với %(site_name)s. Để hoàn tất đăng ký và xác minh địa chỉ email của bạn, vui lòng sử dụng mật khẩu một lần (OTP) dưới đây:</p>

source: <p class="instructions">This code will expire in **%(otp_expiry_minutes)s minutes**.</p>
vi: <p class="instructions">Mã này sẽ hết hạn trong **%(otp_expiry_minutes)s phút**.</p>

source: Do not share this code with anyone, even if they claim to be from %(site_name)s.
vi: Không chia sẻ mã này với bất kỳ ai, ngay cả khi họ tự xưng đến từ %(site_name)s.

source: If you did not create an account with us, please ignore this email.
vi: Nếu bạn không tạo tài khoản với chúng tôi, vui lòng bỏ qua email này.

source: <p>You received this email because you recently registered at %(site_name)s.</p>
vi: <p>Bạn nhận được email này vì bạn gần đây đã đăng ký tại %(site_name)s.</p>

source: Your account has been deactivated - %(site_name)s
vi: Tài khoản của bạn đã bị vô hiệu hóa - %(site_name)s

source: You
vi: Bạn

source: We are sending this email to inform you that your account at <strong><a href="%(frontend_url)s" target="_blank">%(site_name)s</a></strong> has been temporarily deactivated. This usually happens when there are too many failed login attempts, and is intended to protect your account from unauthorized access.
vi: Chúng tôi gửi email này để thông báo rằng tài khoản của bạn tại <strong><a href="%(frontend_url)s" target="_blank">%(site_name)s</a></strong> đã bị vô hiệu hóa tạm thời. Điều này thường xảy ra khi có quá nhiều lần đăng nhập thất bại, và nhằm mục đích bảo vệ tài khoản của bạn khỏi truy cập trái phép.

source: To restore access to your account, please click the button below to reset your password.
vi: Để khôi phục quyền truy cập vào tài khoản của bạn, vui lòng nhấp vào nút dưới đây để đặt lại mật khẩu của bạn.

source: Reset your password
vi: Đặt lại mật khẩu của bạn

source: If you have not made any recent login attempts, please contact our support team immediately for assistance.
vi: Nếu bạn không thực hiện bất kỳ lần đăng nhập gần đây nào, vui lòng liên hệ ngay đội ngũ hỗ trợ của chúng tôi để được trợ giúp.

source: You received this email because your account at %(site_name)s has been deactivated.
vi: Bạn nhận được email này vì tài khoản của bạn tại %(site_name)s đã bị vô hiệu hóa.

source: If you have any questions, please contact us at
vi: Nếu bạn có bất kỳ câu hỏi nào, vui lòng liên hệ với chúng tôi tại

source: Your account has been blocked
vi: Tài khoản của bạn đã bị chặn

source: %(site_name)s - Your Password Reset Code
vi: %(site_name)s - Mã đặt lại mật khẩu của bạn

source: Hello
vi: Xin chào

source: <p>You recently requested to reset your password for your %(site_name)s account. Please use the following one-time password (OTP) to complete the process:</p>
vi: <p>Bạn gần đây đã yêu cầu đặt lại mật khẩu cho tài khoản %(site_name)s của mình. Vui lòng sử dụng mật khẩu một lần (OTP) sau để hoàn tất quá trình:</p>

source: <p class="instructions">This code is valid for **%(otp_expiry_minutes)s minutes**.</p>
vi: <p class="instructions">Mã này có hiệu lực trong **%(otp_expiry_minutes)s phút**.</p>

source: For your security, do not share this code with anyone, even if they claim to be from %(site_name)s.
vi: Vì sự an toàn của bạn, đừng chia sẻ mã này với bất kỳ ai, ngay cả khi họ tự xưng đến từ %(site_name)s.

source: Password must contain at least 8 characters, one uppercase letter, one lowercase letter, one number and one special character (@, $, !, %, *, #, ?, &.).
vi: Mật khẩu phải chứa ít nhất 8 ký tự, một chữ cái viết hoa, một chữ cái viết thường, một số và một ký tự đặc biệt (@, $, !, %, *, #, ?, &.).

source: Only characters and spaces are allowed.
vi: Chỉ cho phép ký tự và khoảng trắng.

source: Phone number must start with '+', followed by country code (1-4 digits), an optional space, and then 7-15 digits.
vi: Số điện thoại phải bắt đầu bằng '+', theo sau là mã quốc gia (1-4 chữ số), một khoảng trắng tùy chọn, và sau đó là 7-15 chữ số.

source: Required cookie is missing
vi: Thiếu cookie bắt buộc

source: Cookie data is invalid.
vi: Dữ liệu cookie không hợp lệ.

source: Cookie data has expired. Please request a new one.
vi: Dữ liệu cookie đã hết hạn. Vui lòng yêu cầu một cái mới.
